---
type: ExportDWGSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ExportDWGSettings

`Autodesk.Revit.DB.ExportDWGSettings` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | FindByName | 2018 | `public static ExportDWGSettings FindByName ( Document aDoc , string name )` |
| Method | GetActivePredefinedSettings | 2018 | `public static ExportDWGSettings GetActivePredefinedSettings ( Document aDoc )` |
| Method | GetDWGExportOptions | 2013 | `public DWGExportOptions GetDWGExportOptions ()` |
| Method | GetDXFExportOptions | 2013 | `public DXFExportOptions GetDXFExportOptions ()` |
| Method | ListNames | 2013 | `public static IList < string > ListNames ( Document aDoc )` |
| Method | SetDWGExportOptions | 2013 | `public void SetDWGExportOptions ( DWGExportOptions options )` |
| Method | SetDXFExportOptions | 2013 | `public void SetDXFExportOptions ( DXFExportOptions options )` |
| Property | Parameter | — | `` |